XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31R71x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31R71x_Series</name>
  <description>ABOV Semiconductor CM0+ Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>

  <releases>
    <release version="1.5.0" date="2021-06-28">
      *  Updated version rule
      *  Updated Keil Pack File Name :  ABOV.A31R7xx_DFP  ==> ABOV.A31R71x_Series
      *  Fixed WT_CR_WTIFLAG define
      *  Fixed HAL_GPIO_ConfigOutput()
      *  Fixed I2Cn_Mwait():   I2Cx ->ST ==> tmp
    </release>
    <release version="1.4.0" date="2020-11-30">
      *  Fixed Driver:   SCUCG_StopMonClk()  ==> HAL_SCU_ClockMonitoring_Disable()
    </release>
    <release version="1.3.0" date="2020-09-11">
      *  Fixed TIMER2n struct ADR Type:   uint16_t  ==> uint32_t
      *  Fixed TIMER2n struct BDR Type:   uint16_t  ==> uint32_t
      *  Fixed HAL_TIMER2n_GetCaptureData():   uint16_t  ==> uint32_t
      *  Added define: TIMER2n_GetCnt( TIMER2x )
    </release>
    <release version="1.2.0" date="2020-07-27">
      *  Changed @author:   "ABOV M team" ==> "ABOV Application Team"
      *  Fixed HAL_UART_Transmit():   UART1 ==> UARTx
      *  Added the registers for Configuration Option Area Page 0 in svd file
    </release>
    <release version="1.1.0" date="2020-05-29">
      *  Added folder:   Core/CMSIS/Include
      *  Added folder:   SFR
      *  Changed folder structure:   Device ---> Core/Device
      *  Changed folder name:   Documentation --> Doc
      *  Deleted file:   slib.c
      *  Deleted file:   slib.h
      *  Added file:   Drivers/Include/A31R71x_hal_libcfg.h
      *  Added file:   Examples/.../A31R71x_it.*
      *  Added file:   Examples/.../A31R71x_PortInit.c
      *  Added file:   Examples/.../A31R71x_SystemClock.c
      *  Added file:   Examples/.../main_conf.h
      *  Merged file:   A31R71x_SCUCC.* + A31R71x_SCUCG.* ==> A31R71x_SCU.*
      *  Changed file name:   Driver/*.*
      *  Changed file:   Device/
      *  Changed file:   Drivers/
      *  Changed file:   Examples/
    </release>
    <release version="1.0.0" date="2019-10-01">
      Initial Version
      Fixed I2Cn_Init() I2Cn_DeInit()
      Fixed USART1n_DataControlConfig()
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31R</keyword>
    <keyword>A31R71x</keyword>
    <keyword>A31R713</keyword>
  </keywords>

  <devices>
    <family Dfamily="A31R71x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>
        The ABOV A31R series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals
      </description>
      <!-- Subfamily : A31R71x *********************************************************-->
      <subFamily DsubFamily="A31R71x">
        <processor Dclock="40000000" />
        <compile header="A31R71x/Core/Device/ABOV/A31R71x/Include/A31R71x.h" />
        <debug svd="A31R71x/SVD/A31R71x.svd" />
        <algorithm name="A31R71x\FlashLoader\KEIL\A31R71x_FLASH.FLM" start="0x00000000" size="0x10000" default="1" />
        <algorithm name="A31R71x\FlashLoader\KEIL\A31R71x_CFG.FLM" start="0x1FFFF200" size="0x600" default="1" />
        <feature type="VCC" n="1.8" m="5.5" />
        <feature type="Temp" n="-40" m="85" />
        <memory id="IRAM1" start="0x20000000" size="0x2000" init="0" default="1" />
        <feature type="WDT" n="1" m="40" name="Watchdog Timer" />
        <!-- Device : A31R713 -->
        <device Dname="A31R713">
          <description>Package type 80,48LQFP,64TQFP</description>
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- condition : A31R71x *********************************************************-->
    <condition id="A31R71x CMSIS">
      <description>A31R71x device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31R713" />
    </condition>
  </conditions>

  <components>
    <!-- component : A31R71x *********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>System Startup for ABOV A31R71x devices</description>
      <files>
        <file category="include" name="A31R71x/Core/Device/ABOV/A31R71x/Include/" />
        <file category="include" name="A31R71x/Drivers/Include/" />
        <file category="header" version="1.0.0" name="A31R71x/Core/Device/ABOV/A31R71x/Include/A31R71x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31R71x/Core/Device/ABOV/A31R71x/Include/system_A31R71x.h" attr="config" />
        <file category="source" version="1.0.0" name="A31R71x/Core/Device/ABOV/A31R71x/Source/ARM/startup_A31R71x.s" attr="config" />
        <file category="source" version="1.0.0" name="A31R71x/Core/Device/ABOV/A31R71x/Source/system_A31R71x.c" attr="config" />
        <file category="source" version="1.0.0" name="A31R71x/Option/KEIL/option_A31R71x.s" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_FrameWork" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x Debug Framework</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_aa_types.h" />
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_libcfg.h" />
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_wtidky.h" />
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_debug_frmwrk.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_debug_frmwrk.c" />
      </files>
    </component>
