XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31R71x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x ADC Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_adc.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x CRC Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_crc.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FMC" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x FMC Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_fmc.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_fmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2Cn" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x I2Cn Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_i2cn.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_i2cn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="INTC" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x Interrupt Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_intc.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_intc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="LCD" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x LCD Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_lcd.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x PCU Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_pcu.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x PWR Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_pwr.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x SCUCC/SCUCG Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_scu.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCULV" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x SCULV Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_sculv.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_sculv.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER1n" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x TIMER1n Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_timer1n.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_timer1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER2n" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x TIMER2n Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_timer2n.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_timer2n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="UARTn" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x UARTn Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_uartn.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_uartn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="USART1n" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x USART1n Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_usart1n.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_usart1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x WDT Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_wdt.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WT" Cversion="1.0.0" condition="A31R71x CMSIS">
      <description>A31R71x WT Control</description>
      <files>
        <file category="header" name="A31R71x/Drivers/Include/A31R71x_hal_wt.h" />
        <file category="source" name="A31R71x/Drivers/Source/A31R71x_hal_wt.c" />
      </files>
    </component>
  </components>

